; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v11 ?v8)
             (pred_7 ?v9 ?v3)
             (pred_5 ?v11 ?v3)
             (pred_10 ?v13 ?v11 )
	     (pred_6 ?v11)
             (pred_9 ?v10)
             (pred_4 ?v9)
             (pred_1 ?v3)
             (pred_8 ?v11)
             (pred_3 ?v9)
             (pred_11 ?v11)
             (pred_12 ))



(:action op_3
:parameters (?v5 ?v2 ?v6 ?v12)
:precondition (and (pred_9 ?v5) (pred_9 ?v2) (pred_4 ?v6) (pred_1 ?v12)
          (pred_2 ?v5 ?v2) (pred_7 ?v6 ?v12)
                   (pred_5 ?v2 ?v12) (pred_6 ?v5) 
                   (pred_8 ?v2) (pred_3 ?v6))
:effect (and  (pred_11 ?v2) (not (pred_8 ?v2))))


(:action op_1
:parameters (?v5 ?v4)
:precondition (and (pred_9 ?v5) (pred_9 ?v4)
               (pred_6 ?v5) (pred_2 ?v5 ?v4) (pred_11 ?v4))
:effect (and (pred_6 ?v4) (not (pred_6 ?v5))))

(:action op_5
:parameters (?v5 ?v6)
:precondition (and (pred_9 ?v5) (pred_4 ?v6) 
                  (pred_6 ?v5) (pred_10 ?v6 ?v5) (pred_12 ))
:effect (and (pred_3 ?v6)
   (not (pred_10 ?v6 ?v5)) (not (pred_12 ))))


(:action op_4
:parameters (?v5 ?v7 ?v1)
:precondition (and (pred_9 ?v5) (pred_4 ?v7) (pred_4 ?v1)
                  (pred_6 ?v5) (pred_3 ?v1) (pred_10 ?v7 ?v5))
:effect (and (pred_3 ?v7) (pred_10 ?v1 ?v5)
        (not (pred_3 ?v1)) (not (pred_10 ?v7 ?v5))))

(:action op_2
:parameters (?v5 ?v6)
:precondition (and (pred_9 ?v5) (pred_4 ?v6) 
                  (pred_6 ?v5) (pred_3 ?v6))
:effect (and (pred_12 ) (pred_10 ?v6 ?v5) (not (pred_3 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_19 obj_09 obj_23 obj_30 obj_07 obj_06 obj_14 obj_15 obj_04 obj_18 obj_31 obj_03 obj_21 obj_29 obj_02 obj_25 obj_10 obj_11 obj_13 obj_01 obj_32 obj_24 obj_17 obj_05 obj_22
    obj_26 obj_28 obj_16
    obj_12 obj_27 obj_08 obj_20
    )

    (:init
       (pred_12)

       (pred_9 obj_19)
       (pred_9 obj_09)
       (pred_9 obj_23)
       (pred_9 obj_30)
       (pred_9 obj_07)
       (pred_9 obj_06)
       (pred_9 obj_14)
       (pred_9 obj_15)
       (pred_9 obj_04)
       (pred_9 obj_18)
       (pred_9 obj_31)
       (pred_9 obj_03)
       (pred_9 obj_21)
       (pred_9 obj_29)
       (pred_9 obj_02)
       (pred_9 obj_25)
       (pred_9 obj_10)
       (pred_9 obj_11)
       (pred_9 obj_13)
       (pred_9 obj_01)
       (pred_9 obj_32)
       (pred_9 obj_24)
       (pred_9 obj_17)
       (pred_9 obj_05)
       (pred_9 obj_22)
       (pred_1 obj_26)
       (pred_1 obj_28)
       (pred_1 obj_16)
       (pred_4 obj_12)
       (pred_4 obj_27)
       (pred_4 obj_08)
       (pred_4 obj_20)

       (pred_2 obj_19 obj_06)
       (pred_2 obj_19 obj_09)
       (pred_2 obj_09 obj_14)
       (pred_2 obj_09 obj_23)
       (pred_2 obj_09 obj_19)
       (pred_2 obj_23 obj_15)
       (pred_2 obj_23 obj_30)
       (pred_2 obj_23 obj_09)
       (pred_2 obj_30 obj_04)
       (pred_2 obj_30 obj_07)
       (pred_2 obj_30 obj_23)
       (pred_2 obj_07 obj_18)
       (pred_2 obj_07 obj_30)
       (pred_2 obj_06 obj_31)
       (pred_2 obj_06 obj_14)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_14 obj_03)
       (pred_2 obj_14 obj_15)
       (pred_2 obj_14 obj_09)
       (pred_2 obj_14 obj_06)
       (pred_2 obj_15 obj_21)
       (pred_2 obj_15 obj_04)
       (pred_2 obj_15 obj_23)
       (pred_2 obj_15 obj_14)
       (pred_2 obj_04 obj_29)
       (pred_2 obj_04 obj_18)
       (pred_2 obj_04 obj_30)
       (pred_2 obj_04 obj_15)
       (pred_2 obj_18 obj_02)
       (pred_2 obj_18 obj_07)
       (pred_2 obj_18 obj_04)
       (pred_2 obj_31 obj_25)
       (pred_2 obj_31 obj_03)
       (pred_2 obj_31 obj_06)
       (pred_2 obj_03 obj_10)
       (pred_2 obj_03 obj_21)
       (pred_2 obj_03 obj_14)
       (pred_2 obj_03 obj_31)
       (pred_2 obj_21 obj_11)
       (pred_2 obj_21 obj_29)
       (pred_2 obj_21 obj_15)
       (pred_2 obj_21 obj_03)
       (pred_2 obj_29 obj_13)
       (pred_2 obj_29 obj_02)
       (pred_2 obj_29 obj_04)
       (pred_2 obj_29 obj_21)
       (pred_2 obj_02 obj_01)
       (pred_2 obj_02 obj_18)
       (pred_2 obj_02 obj_29)
       (pred_2 obj_25 obj_32)
       (pred_2 obj_25 obj_10)
       (pred_2 obj_25 obj_31)
       (pred_2 obj_10 obj_24)
       (pred_2 obj_10 obj_11)
       (pred_2 obj_10 obj_03)
       (pred_2 obj_10 obj_25)
       (pred_2 obj_11 obj_17)
       (pred_2 obj_11 obj_13)
       (pred_2 obj_11 obj_21)
       (pred_2 obj_11 obj_10)
       (pred_2 obj_13 obj_05)
       (pred_2 obj_13 obj_01)
       (pred_2 obj_13 obj_29)
       (pred_2 obj_13 obj_11)
       (pred_2 obj_01 obj_22)
       (pred_2 obj_01 obj_02)
       (pred_2 obj_01 obj_13)
       (pred_2 obj_32 obj_24)
       (pred_2 obj_32 obj_25)
       (pred_2 obj_24 obj_17)
       (pred_2 obj_24 obj_10)
       (pred_2 obj_24 obj_32)
       (pred_2 obj_17 obj_05)
       (pred_2 obj_17 obj_11)
       (pred_2 obj_17 obj_24)
       (pred_2 obj_05 obj_22)
       (pred_2 obj_05 obj_13)
       (pred_2 obj_05 obj_17)
       (pred_2 obj_22 obj_01)
       (pred_2 obj_22 obj_05)
       (pred_8 obj_25)
       (pred_8 obj_04)
       (pred_8 obj_09)
       (pred_8 obj_05)
       (pred_5  obj_25 obj_26)
       (pred_5  obj_04 obj_28)
       (pred_5  obj_09 obj_16)
       (pred_5  obj_05 obj_16)
       (pred_11 obj_19)
       (pred_11 obj_23)
       (pred_11 obj_30)
       (pred_11 obj_07)
       (pred_11 obj_06)
       (pred_11 obj_14)
       (pred_11 obj_15)
       (pred_11 obj_18)
       (pred_11 obj_31)
       (pred_11 obj_03)
       (pred_11 obj_21)
       (pred_11 obj_29)
       (pred_11 obj_02)
       (pred_11 obj_10)
       (pred_11 obj_11)
       (pred_11 obj_13)
       (pred_11 obj_01)
       (pred_11 obj_32)
       (pred_11 obj_24)
       (pred_11 obj_17)
       (pred_11 obj_22)

       (pred_7  obj_12 obj_26)
       (pred_7  obj_27 obj_28)
       (pred_7  obj_08 obj_16)
       (pred_7  obj_20 obj_16)
       (pred_10 obj_12 obj_01)
       (pred_10 obj_27 obj_14)
       (pred_10 obj_08 obj_14)
       (pred_10 obj_20 obj_14)
       (pred_6 obj_29)
    )

    (:goal (and
       (pred_10 obj_12 obj_23)
       (pred_10 obj_20 obj_21)
    ))
(:constraints
  (always (not (pred_6 obj_15)))
)
)

; plan
1. (op_1 obj_29 obj_21)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_21)
   goals met: 0 of 2
2. (op_1 obj_21 obj_03)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_03)
   goals met: 0 of 2
3. (op_1 obj_03 obj_14)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_14)
   goals met: 0 of 2
4. (op_5 obj_14 obj_20)
   deleted: (pred_10 obj_20 obj_14) (pred_12)
   added: (pred_3 obj_20)
   goals met: 0 of 2
5. (op_1 obj_14 obj_03)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_03)
   goals met: 0 of 2
6. (op_1 obj_03 obj_21)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_21)
   goals met: 0 of 2
7. (op_1 obj_21 obj_29)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_29)
   goals met: 0 of 2
8. (op_1 obj_29 obj_02)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_02)
   goals met: 0 of 2
9. (op_2 obj_02 obj_20)
   deleted: (pred_3 obj_20)
   added: (pred_12) (pred_10 obj_20 obj_02)
   goals met: 0 of 2
10. (op_1 obj_02 obj_01)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_01)
   goals met: 0 of 2
11. (op_5 obj_01 obj_12)
   deleted: (pred_10 obj_12 obj_01) (pred_12)
   added: (pred_3 obj_12)
   goals met: 0 of 2
12. (op_1 obj_01 obj_02)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_02)
   goals met: 0 of 2
13. (op_4 obj_02 obj_20 obj_12)
   deleted: (pred_3 obj_12) (pred_10 obj_20 obj_02)
   added: (pred_3 obj_20) (pred_10 obj_12 obj_02)
   goals met: 0 of 2
14. (op_1 obj_02 obj_29)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_29)
   goals met: 0 of 2
15. (op_1 obj_29 obj_21)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_21)
   goals met: 0 of 2
16. (op_2 obj_21 obj_20)
   deleted: (pred_3 obj_20)
   added: (pred_12) (pred_10 obj_20 obj_21)
   goals met: 1 of 2
17. (op_1 obj_21 obj_29)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_29)
   goals met: 1 of 2
18. (op_1 obj_29 obj_02)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_02)
   goals met: 1 of 2
19. (op_5 obj_02 obj_12)
   deleted: (pred_10 obj_12 obj_02) (pred_12)
   added: (pred_3 obj_12)
   goals met: 1 of 2
20. (op_1 obj_02 obj_18)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_18)
   goals met: 1 of 2
21. (op_1 obj_18 obj_07)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_07)
   goals met: 1 of 2
22. (op_1 obj_07 obj_30)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_30)
   goals met: 1 of 2
23. (op_1 obj_30 obj_23)
   deleted: (pred_6 obj_30)
   added: (pred_6 obj_23)
   goals met: 1 of 2
24. (op_2 obj_23 obj_12)
   deleted: (pred_3 obj_12)
   added: (pred_12) (pred_10 obj_12 obj_23)
   goals met: 2 of 2
